jmeter_selenium_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JMeter Selenium Test" enabled="true">
      <stringProp name="TestPlan.comments">Integración de JMeter con Selenium WebDriver</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <!-- Definimos una variable para la URL -->
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">https://www.google.com</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Usuarios Concurrentes" enabled="true">
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <stringProp name="ThreadGroup.duration">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.webdriver.sampler guiclass="WebDriverSamplerGui" testclass="WebDriverSampler" testname="Abrir Página con Selenium" enabled="true">
          <stringProp name="WebDriverSampler.script">
            // Iniciar medición
            WDS.sampleResult.sampleStart();

            // Obtener URL desde variable JMeter
            var url = vars.get("BASE_URL");
            WDS.log.info("Abriendo URL: " + url);
            WDS.browser.get(url);
            
            // Esperar hasta que la página cargue completamente
            var wait = new org.openqa.selenium.support.ui.WebDriverWait(WDS.browser, 10);
            wait.until(org.openqa.selenium.support.ui.ExpectedConditions.presenceOfElementLocated(org.openqa.selenium.By.name("q")));

            WDS.log.info("Página completamente cargada");

            // Finalizar medición
            WDS.sampleResult.sampleEnd();
          </stringProp>
        </kg.apc.jmeter.webdriver.sampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsTreeGui" testclass="ResultCollector" testname="Ver Resultados" enabled="true">
        </ResultCollector>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>